# چاپ عنوان انتخابات و نام نامزدها
print("............هشتمین انتخابات ریاست جمهوری ایران...........")
print("نام و نام خانوادگی نامرد های انتخاباتی")
print("**********سعید جلیلی************")
print("********مسعود پزشکیان*************")
print("**********محمد باقر قالی باف*******")

# مجموعه‌ای برای ذخیره کد ملی رأی‌دهندگان
code_meli = set()

# متغیرهای شمارش آرا
pezeshkian = 0  # شمارش آرا برای مسعود پزشکیان
jalili = 0      # شمارش آرا برای سعید جلیلی
ghalibaf = 0    # شمارش آرا برای محمد باقر قالی باف
len_code_meli = 0  # طول مجموعه کد ملی برای جلوگیری از رأی‌گیری تکراری
batel = 0       # شمارش آرا باطل

while True:
    # ورودی کد ملی
    vote = int(input("کد ملی خودتان را وارد کنید: "))
    
    # ورودی رأی خود
    ray = input("به کی رأی می‌دهید (پزشکیان، جلیل، قالی باف) یا برای خروج 0 را وارد کنید: ")
    
    # اضافه کردن کد ملی به مجموعه
    code_meli.add(vote)
    
    # بررسی اینکه آیا رأی‌دهنده قبلاً رأی داده است یا خیر
    if len(code_meli) > len_code_meli:
        if ray == "پزشکیان":
            pezeshkian += 1  # افزایش شمارش رأی برای پزشکیان
        elif ray == "جلیل":
            jalili += 1      # افزایش شمارش رأی برای جلیل
        elif ray == "قالی باف":
            ghalibaf += 1    # افزایش شمارش رأی برای قالی باف
        else:
            batel += 1       # افزایش شمارش رأی باطل
            
    # به‌روزرسانی طول مجموعه کد ملی
    len_code_meli = len(code_meli)
    
    # بررسی برای خروج از حلقه
    if ray == "0":
        break

# چاپ نتایج نهایی رأی‌گیری
print("آرا برای مسعود پزشکیان:", pezeshkian)
print("آرا برای سعید جلیلی:", jalili)
print("آرا برای محمد باقر قالی باف:", ghalibaf)
print("آرا باطل:", batel)
print("کد ملی رأی‌دهندگان:", code_meli)
