# دریافت ورودی از کاربر برای محل درد
makan_dard = input("کجای شما درد می‌کند؟ (شکم . گلو . سینه . هیچکدام): ")

# بررسی محل درد
if makan_dard == "شکم":
    # اگر درد در ناحیه شکم باشد
    Result = "شما اپاندیس دارید" 

elif makan_dard == "گلو":
    # اگر درد در ناحیه گلو باشد
    tab = input("شما تب دارید؟ (بله . خیر): ")
    
    if tab == "بله":
        # اگر کاربر تب دارد
        Result = "شما باکتری دارید"
    elif tab == "خیر":
        # اگر کاربر تب ندارد
        Result = "شما ویروس دارید"
    else:
        # اگر ورودی نامعتبر باشد
        Result = "لطفاً مثل آدم جواب بده"

elif makan_dard == "سینه":
    # اگر درد در ناحیه سینه باشد
    Result = "شما سکته می‌کنید و به امید خدا می‌میرید"

elif makan_dard == "هیچکدام":
    # اگر کاربر هیچ دردی نداشته باشد
    Result = "تو مریض نیستی و منو مسخره کردی"

else:
    # اگر ورودی نامعتبر باشد
    Result = "ورودی نامعتبر است. لطفاً یکی از گزینه‌ها را انتخاب کنید."

# چاپ نتیجه نهایی
print(Result)
