
# لیست متون موجود
matnha = [
    "مرتضی شم آبادی هستم و کلاس دهم را می‌گذرانم.",
    "گوشی نوت 10 پرو یکی از بهترین گوشی‌های موجود در بازار است.",
    "آدرس مدرسه صادقیه در خیابان اصلی قرار دارد.",
    "عکس حرم امام حسین یکی از زیباترین تصاویر مذهبی است."
]

print('سلام به هوش مصنوعی، خوش آمدید')  # پیام خوش آمدگویی به کاربر
history = []  # لیست تاریخچه جستجوها

while True:  # حلقه‌ای بی‌پایان برای دریافت ورودی کاربر
    # دریافت عبارت جستجو از کاربر
    search = input("(برای اضافه کردن متن 'add' را وارد کنید، برای خروج 'no' را وارد کنید) جستجو...")  
    
    if search == 'no':  # اگر کاربر 'no' را وارد کند
        print("خروج از برنامه. خداحافظ!")  # پیام خداحافظی
        break  # حلقه را ترک می‌کند و برنامه متوقف می‌شود  
    
    if search == "history":  # اگر کاربر 'history' را وارد کند
        print("تاریخچه جستجو:", history)  # تاریخچه جستجوها را چاپ می‌کند  
        continue  # به ابتدای حلقه برمی‌گردد  
    
    if search == 'delete':  # اگر کاربر 'delete' را وارد کند
        delete_text = input("متنی که می‌خواهید حذف کنید را وارد کنید: ")  # دریافت متن برای حذف
        if delete_text in matnha:  # بررسی وجود متن در لیست
            matnha.remove(delete_text)  # حذف متن از لیست
            print(f"متن '{delete_text}' با موفقیت حذف شد.")  
        else:
            print(f"متن '{delete_text}' در لیست وجود ندارد.")  # پیام در صورت عدم وجود متن
        continue  # به ابتدای حلقه برمی‌گردد  

    if search == 'add':  # اگر کاربر 'add' را وارد کند
        Add = input("متن مورد نظر را وارد کنید: ")  # دریافت متن جدید از کاربر
        matnha.append(Add)  # اضافه کردن متن جدید به لیست
        print('متن با موفقیت اضافه شد')  
        continue  # به ابتدای حلقه برمی‌گردد  
    
    found = False  # متغیری برای بررسی وجود متن پیدا شده
    for text in matnha:  # برای هر متن در لیست متون
        if search in text:  # بررسی می‌کند که آیا عبارت جستجو شده در متن وجود دارد
            print(f"متن پیدا شده: {text}")  # اگر متن پیدا شد، آن را چاپ می‌کند
            found = True  # اگر متنی پیدا شد، متغیر found را به True تغییر می‌دهیم  
    
    if not found:  # اگر هیچ متنی پیدا نشد
        print('متن مورد نظر پیدا نشد')  # پیغام مربوط به پیدا نشدن متن را چاپ می‌کنیم  
    
    # ذخیره عبارت جستجو شده در تاریخچه، اگر این عبارت یک دستور خاص نباشد
    if search not in ['history', 'add', 'delete']:  # اگر عبارت جستجو شده history یا add یا delete نباشد 
        history.append(search)  # عبارت جستجو شده را به تاریخچه اضافه می‌کنیم
