# نمایش پیام خوشامدگویی
print("# سلام! تو میتونی یک متن به من بدی و من اون متن رو برای تو جدا می‌کنم...")

# دریافت متن از کاربر
text = input("یک متن وارد کنید: ")

# ایجاد یک مجموعه برای ذخیره کاراکترهای منحصر به فرد
unique_characters = set()

# حلقه برای اضافه کردن کاراکترها به مجموعه
for char in text:
    unique_characters.add(char)

# نمایش تعداد کاراکترهای منحصر به فرد
print("تعداد کاراکترهای منحصر به فرد:", len(unique_characters))

# جدا کردن کلمات متن بر اساس فاصله
words = text.split()
print("کلمات جدا شده:", words)

# نمایش پیام خوشامدگویی برای قسمت بعدی
print("# تو میتونی یک متن به من بدی و من اون متن رو برای تو بر اساس ویرگول‌ها یا فاصله‌ها جدا کنم...")

# دریافت متن جدید از کاربر
t = input("یک متن وارد کنید: ")

# جدا کردن متن بر اساس ویرگول
separated_by_comma = t.split(",")
print("متن جدا شده بر اساس ویرگول:", separated_by_comma)

# جدا کردن متن بر اساس فاصله
separated_by_space = t.split()
print("متن جدا شده بر اساس فاصله:", separated_by_space)
